Pickup_Pkg_Gnd/PickupforPACKAGEWebService/SampleXmls/SamplePickupRequest.xml

<envr:Envelope xmlns:envr="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:common="http://www.ups.com/XMLSchema/XOLTWS/Common/v1.0" xmlns:upss="http://www.ups.com/XMLSchema/XOLTWS/UPSS/v1.0">
   <envr:Header>
      <upss:UPSSecurity>
         <upss:UsernameToken>
            <upss:Username>Your User ID</upss:Username>
            <upss:Password>Your Password</upss:Password>
         </upss:UsernameToken>
         <upss:ServiceAccessToken>
            <upss:AccessLicenseNumber>Your Access License Number</upss:AccessLicenseNumber>
         </upss:ServiceAccessToken>
      </upss:UPSSecurity>
   </envr:Header>
   <envr:Body>
      <PickupCreationRequest xmlns="http://www.ups.com/XMLSchema/XOLTWS/Pickup/v1.1" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
         <common:Request>
            <common:RequestOption/>
            <common:TransactionReference>
               <common:CustomerContext>Your Customer Context</common:CustomerContext>
            </common:TransactionReference>
         </common:Request>
         <RatePickupIndicator>Y</RatePickupIndicator>
         <TaxInformationIndicator>Y</TaxInformationIndicator>
         <Shipper>
            <ChargeCard>
               <CardHolderName>Test user</CardHolderName>
               <CardType>06</CardType>
               <CardNumber>4023602222222125</CardNumber>
               <ExpirationDate>201808</ExpirationDate>
               <SecurityCode>737</SecurityCode>
               <CardAddress>
                  <AddressLine>2311 York Rd</AddressLine>
                  <City>Rome</City>
                  <PostalCode>21093</PostalCode>
                  <CountryCode>IT</CountryCode>
               </CardAddress>
            </ChargeCard>
         </Shipper>
         <PickupDateInfo>
            <CloseTime>1400</CloseTime>
            <ReadyTime>0500</ReadyTime>
            <PickupDate>20160405</PickupDate>
         </PickupDateInfo>
         <PickupAddress>
            <CompanyName>X company</CompanyName>
            <ContactName>Y Manager</ContactName>
            <AddressLine>35 Thompson Drive</AddressLine>
            <City>Timonium</City>
            <StateProvince>MD</StateProvince>
            <PostalCode>21093</PostalCode>
            <CountryCode>US</CountryCode>
            <ResidentialIndicator>Y</ResidentialIndicator>
            <Phone>
               <Number>6785851399</Number>
               <Extension>911</Extension>
            </Phone>
         </PickupAddress>
         <AlternateAddressIndicator>Y</AlternateAddressIndicator>
         <PickupPiece>
            <ServiceCode>001</ServiceCode>
            <Quantity>1</Quantity>
            <DestinationCountryCode>US</DestinationCountryCode>
            <ContainerCode>01</ContainerCode>
         </PickupPiece>
         <TotalWeight>
            <Weight>5.5</Weight>
            <UnitOfMeasurement>LBS</UnitOfMeasurement>
         </TotalWeight>
         <OverweightIndicator>N</OverweightIndicator>
         <PaymentMethod>03</PaymentMethod>
      </PickupCreationRequest>
   </envr:Body>
</envr:Envelope>