htdocs/synopsisapple/ups/api/collection/PickupPACKAGEWebService/SampleXmls/SamplePickupRequest.xml

<envr:Envelope xmlns:envr="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:common="http://www.ups.com/XMLSchema/XOLTWS/Common/v1.0" xmlns:wsf="http://www.ups.com/schema/wsf" xmlns:upss="http://www.ups.com/XMLSchema/XOLTWS/UPSS/v1.0">
	<envr:Header>
		<upss:UPSSecurity>
			<upss:UsernameToken>
				<upss:Username>JCOLEV</upss:Username>
				<upss:Password>JCOLEV</upss:Password>
			</upss:UsernameToken>
			<upss:ServiceAccessToken>
				<upss:AccessLicenseNumber>EC408514586D9EA8</upss:AccessLicenseNumber>
			</upss:ServiceAccessToken>
		</upss:UPSSecurity>
				<!--
		<common:ClientInformation>
			<common:Property Key="DataSource">IS</common:Property>
		</common:ClientInformation> -->
		<common:ClientInformation>
			<common:Property Key="DataSource">AG</common:Property>
			<common:Property Key="ClientCode">APS</common:Property>
		</common:ClientInformation>
		<!--
		<common:ClientInformation>
				<common:Property Key="DataSource">ECM</common:Property>
				<common:Property Key="ClientCode">CAReS</common:Property>
		</common:ClientInformation>	-->
	</envr:Header>
	<envr:Body>
		<PickupCreationRequest xmlns="http://www.ups.com/XMLSchema/XOLTWS/Pickup/v1.1" xmlns:common="http://www.ups.com/XMLSchema/XOLTWS/Common/v1.0" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
			<common:Request>
				<common:RequestOption/>
				<common:TransactionReference>
					<common:CustomerContext>d9 Different Client-- shipper account payment method -</common:CustomerContext>
				</common:TransactionReference>
			</common:Request>
			<RatePickupIndicator>N</RatePickupIndicator>
			<!--<RatePickupIndicator>Y</RatePickupIndicator>-->
			<Shipper>
				<Account>
					<!-- GWN accounts -->
					<!--<AccountNumber>1009YY</AccountNumber>-->
					<!--<AccountNumber>1004YY</AccountNumber>-->
					<AccountNumber>1004YY</AccountNumber>
					<AccountCountryCode>US</AccountCountryCode>
				</Account>
			</Shipper>
			<PickupDateInfo>
				<CloseTime>1400</CloseTime>
				<ReadyTime>0500</ReadyTime>
				<PickupDate>20100104</PickupDate>
			</PickupDateInfo>
			<PickupAddress>
				<CompanyName>Pickup Proxy</CompanyName>
				<ContactName>Pickup Manager</ContactName>
				<AddressLine>315 Saddle Bridge Drive</AddressLine>
				<Room>R01</Room>
				<Floor>2</Floor>
				<City>Allendale</City>
				<StateProvince>NJ</StateProvince>
				<Urbanization/>
				<PostalCode>07401</PostalCode>
				<CountryCode>US</CountryCode>
				<ResidentialIndicator>Y</ResidentialIndicator>
				<PickupPoint>Lobby</PickupPoint>
				<Phone>
					<Number>6785851399</Number>
					<Extension>911</Extension>
				</Phone>
			</PickupAddress>
			<AlternateAddressIndicator>Y</AlternateAddressIndicator>
			<PickupPiece>
				<!-- Next day Air-->
				<ServiceCode>001</ServiceCode>
				<Quantity>27</Quantity>
				<DestinationCountryCode>US</DestinationCountryCode>
				<ContainerCode>01</ContainerCode>
			</PickupPiece>
			<PickupPiece>
				<!-- 3D Select -->
				<ServiceCode>012</ServiceCode>
				<Quantity>4</Quantity>
				<DestinationCountryCode>US</DestinationCountryCode>
				<ContainerCode>01</ContainerCode>
			</PickupPiece>
			<TotalWeight>
				<Weight>5.5</Weight>
				<UnitOfMeasurement>LBS</UnitOfMeasurement>
			</TotalWeight>
			<OverweightIndicator>N</OverweightIndicator>
			<!--  Not return 1Z -->
			<!--<ReturnTrackingNumber>1Z1858WW1612345677</ReturnTrackingNumber>
			<ReturnTrackingNumber>1Z1858WW8912345674</ReturnTrackingNumber>
			<ReturnTrackingNumber>1Z1858WW5009154744</ReturnTrackingNumber>-->
			<!-- ### Paid return 1Z -->
			<!--<ReturnTrackingNumber>1Z1017YYY400000011</ReturnTrackingNumber>-->
			<!-- <ReturnTrackingNumber>1Z1016YY0612345676</ReturnTrackingNumber>-->
			<!-- <ReturnTrackingNumber>1Z1017YY1600000011</ReturnTrackingNumber>-->
			<!-- 01, pay by shipper; 02, pay by return-->
			<PaymentMethod>01</PaymentMethod>
			<!--<PaymentMethod>02</PaymentMethod>-->
			<SpecialInstruction>Jia's Test </SpecialInstruction>
			<ReferenceNumber>CreatePickupRef--Jia</ReferenceNumber>
			<Notification>
				<ConfirmationEmailAddress>jschival@ups.com</ConfirmationEmailAddress>
				<ConfirmationEmailAddress>esc1sxr@ups.com</ConfirmationEmailAddress>
				<UndeliverableEmailAddress>jiawang@ups.com</UndeliverableEmailAddress>
			</Notification>
			<CSR>
				<ProfileId>1-Q83-122</ProfileId>
				<ProfileCountryCode>US</ProfileCountryCode>
			</CSR>
		</PickupCreationRequest>
	</envr:Body>
</envr:Envelope>