test/fixtures/xml/ups/ups_pickup_raw.xml

<envr:Envelope xmlns:envr="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:common="http://www.ups.com/XMLSchema/XOLTWS/Common/v1.0" xmlns:wsf="http://www.ups.com/schema/wsf" xmlns:upss="http://www.ups.com/XMLSchema/XOLTWS/UPSS/v1.0">
  <envr:Header>
    <upss:UPSSecurity>
      <upss:UsernameToken>
        <upss:Username>sven.crone</upss:Username>
        <upss:Password>Holaups2014</upss:Password>
      </upss:UsernameToken>
      <upss:ServiceAccessToken>
        <upss:AccessLicenseNumber>0CCCCED94B9FB025</upss:AccessLicenseNumber>
      </upss:ServiceAccessToken>
    </upss:UPSSecurity>
  </envr:Header>
  <envr:Body>
    <PickupCreationRequest xmlns="http://www.ups.com/XMLSchema/XOLTWS/Pickup/v1.1" xmlns:common="http://www.ups.com/XMLSchema/XOLTWS/Common/v1.0" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
      <RatePickupIndicator>N</RatePickupIndicator>
      <!--<RatePickupIndicator>Y</RatePickupIndicator>-->
      <Shipper>
          <Account>
            <AccountNumber>0VR893</AccountNumber>
            <AccountCountryCode>MX</AccountCountryCode>
          </Account>
      </Shipper>
      <PickupDateInfo>
        <CloseTime>1800</CloseTime>
        <ReadyTime>0900</ReadyTime>
        <PickupDate>20141201</PickupDate>
      </PickupDateInfo>
      <PickupAddress>
        <CompanyName>Zuricata</CompanyName>
        <ContactName>Adele Gonzalez</ContactName>
        <AddressLine>Ejercito 12</AddressLine>
        <City>Mexico DF</City>
        <Urbanization/>
        <PostalCode>11510</PostalCode>
        <CountryCode>MX</CountryCode>
        <ResidentialIndicator>Y</ResidentialIndicator>
        <Phone>
          <Number>6785851399</Number>
        </Phone>
      </PickupAddress>
      <AlternateAddressIndicator>Y</AlternateAddressIndicator>
      <PickupPiece>
        <ServiceCode>065</ServiceCode>
        <Quantity>1</Quantity>
        <DestinationCountryCode>MX</DestinationCountryCode>
        <ContainerCode>01</ContainerCode>
      </PickupPiece>
      <TotalWeight>
        <Weight>5.5</Weight>
        <UnitOfMeasurement>KGS</UnitOfMeasurement>
      </TotalWeight>
      <OverweightIndicator>N</OverweightIndicator>
      <PaymentMethod>00</PaymentMethod>
      <SpecialInstruction>Adress-Referenz</SpecialInstruction>
    </PickupCreationRequest>
  </envr:Body>
</envr:Envelope>